Tekla Open API Reference for Tekla Structures 2025
ProfileItemCrossSection Constructor
Initializes a new instance of the ProfileItemCrossSection class
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ProfileItemCrossSection()
Public Sub New
See Also
Reference
ProfileItemCrossSection Class
Tekla.Structures.Catalogs Namespace